ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_ПробегАвтотранспорта/УТЗ_ПЛ_ПробегАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_ПробегАвтотранспорта</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_МоточасыАвтотранспорта/УТЗ_ПЛ_МоточасыАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_МоточасыАвтотранспорта</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_ОстаткиТоплива/УТЗ_ПЛ_ОстаткиТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_ОстаткиТоплива</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта/УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормаРасходаОсновная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаРасходаДополнительнаяНаПеревозку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_НастройкиПутевыхЛистов/УТЗ_ПЛ_НастройкиПутевыхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_НастройкиПутевыхЛистов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеКоэффициентаВозрастаПробега1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеКоэффициентаВозрастаПробега2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеКоэффициентаКлассаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеКоэффициентаКондиционера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеКоэффициентаНаселенногоПункта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеКоэффициентаСезонного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентВозрастаПробега1</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентВозрастаПробега2</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентКлассаДороги</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентКондиционера</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентНаселенногоПункта</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентСезонный</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </resources>
  <resources>
    <name>МестоПарковкиГрузовогоАвтотранспорта</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_ПунктыМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>МестоПарковкиЛегковогоАвтотранспорта</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_ПунктыМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьВозрастПробег</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьКлассДороги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьКондиционер</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьРазмерНаселенногоПункта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьСезонныйКоэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива/УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыПутевыхЛистов/УТЗ_ПЛ_ВидыПутевыхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыПутевыхЛистов</name>
  <enumValues>
    <name>Легковой</name>
  </enumValues>
  <enumValues>
    <name>Грузовой</name>
  </enumValues>
  <enumValues>
    <name>Строительный</name>
  </enumValues>
  <enumValues>
    <name>Специальный</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ/УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ</name>
  <enumValues>
    <name>КоэффициентНаселенногоПункта</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентКлассаДороги</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВозрастаИПробега</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентГорнойМестности</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентКондиционера</name>
  </enumValues>
  <enumValues>
    <name>СезонныйКоэффициент</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Автотранспорт/УТЗ_ПЛ_Автотранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УТЗ_ПЛ_Автотранспорт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАвтотранспорта</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПутевогоЛистаПоУмолчанию</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыПутевыхЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_МоделиАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственнаяМасса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтотранспорта</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ТипыАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Топливо</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Топливо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВодителей</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОсновнойВодитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/CommonModules/УТЗ_ПЛ_Автотранспорт/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Пробег автотранспорта на дату по списку
//
// Параметры:
//  СписокАвтотранспорта - Массив<СправочникСсылка.УТЗ_ПЛ_Автотранспорт> - список автотранспорта 
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить значения пробегов
// 
// Возвращаемое значение:
//  Соответствие -
//		Ключ - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//		Значение - число - пробег автотранспорта
//
Функция ПробегАвтотранспортаНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности = Неопределено) Экспорт
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСписокАвтотранспорта
	|ИЗ
	|	Справочник.УТЗ_ПЛ_Автотранспорт КАК УТЗ_ПЛ_Автотранспорт
	|ГДЕ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка В(&СписокАвтотранспорта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УТЗ_ПЛ_ПробегАвтотранспортаОстатки.Автотранспорт КАК Автотранспорт,
	|	УТЗ_ПЛ_ПробегАвтотранспортаОстатки.КоличествоОстаток КАК Пробег
	|ПОМЕСТИТЬ ВТПробеги
	|ИЗ
	|	РегистрНакопления.УТЗ_ПЛ_ПробегАвтотранспорта.Остатки(&ДатаАктуальности, Автотранспорт В (&СписокАвтотранспорта)) КАК УТЗ_ПЛ_ПробегАвтотранспортаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокАвтотранспорта.Ссылка КАК Автотранспорт,
	|	ЕСТЬNULL(ВТПробеги.Пробег, 0) КАК Пробег
	|ИЗ
	|	ВТСписокАвтотранспорта КАК ВТСписокАвтотранспорта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПробеги КАК ВТПробеги
	|		ПО ВТСписокАвтотранспорта.Ссылка = ВТПробеги.Автотранспорт";
	
	Запрос.УстановитьПараметр("СписокАвтотранспорта", СписокАвтотранспорта);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Ответ = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Ответ.Вставить(Выборка.Автотранспорт, Выборка.Пробег);
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

// Функция - Пробег автотранспорта на дату по списку
//
// Параметры:
//  Автотранспорт - СправочникСсылка.УТЗ_ПЛ_Автотранспорт - Автотранспорт
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить значения пробегов
// 
// Возвращаемое значение:
//  Число - пробег автотранспорта на дату
//
Функция ПробегАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности = Неопределено) Экспорт
	
	СписокАвтотранспорта = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Автотранспорт);
	Сведения = ПробегАвтотранспортаНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности);
	
	Пробег = 0;
	
	Для Каждого КлючЗначение Из Сведения Цикл 
		Пробег = КлючЗначение.Значение;
	КонецЦикла;
	
	Возврат Пробег;
	
КонецФункции

// Функция - Сведения об автотранспорте на дату по списку
//
// Параметры:
//  СписокАвтотранспорта - Массив - Массив элементов типа СправочникСсылка.УТЗ_ПЛ_Автотранспорт 
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить сведения 
// 
// Возвращаемое значение:
//  Соответствие:
//		Ключ - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//		Значение - Структура:
//						* ВидАвтотранспорта	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыАвтотранспорта
//						* Модель - СправочникСсылка.УТЗ_ПЛ_МоделиАвтотранспорта
//						* ВидПутевогоЛиста - ПеречислениеСсылка.УТЗ_ПЛ_ВидыПутевыхЛистов
//						* ДатаВводаВЭксплуатацию - Дата
//						* Возраст - Число
//						* ОсновнойВодитель - СправочникСсылка.УТЗ_ПЛ_Водители
//						* ПодразделениеВладелец - СправочникСсылка.СтруктураПредприятия
//						* Топливо - СправочникСсылка.УТЗ_ПЛ_Топливо
//						* Пробег - Число
//						* ОстатокТоплива - Число
//						* НормаРасходаОсновная - Число
//						* НормаРасходаДополнительнаяНаПеревозку - Число
//						* Моточасы - Число
Функция СведенияОбАвтотранспортеНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности = Неопределено) Экспорт
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СписокБезДубликатов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокАвтотранспорта);
	
	СтруктураОтвета = Новый Структура;
	
	СтруктураОтвета.Вставить("Автотранспорт", Справочники.УТЗ_ПЛ_Автотранспорт.ПустаяСсылка());
	СтруктураОтвета.Вставить("ВидАвтотранспорта", Перечисления.УТЗ_ПЛ_ВидыАвтотранспорта.ПустаяСсылка());
	СтруктураОтвета.Вставить("Модель", Справочники.УТЗ_ПЛ_МоделиАвтотранспорта.ПустаяСсылка());
	СтруктураОтвета.Вставить("ВидПутевогоЛиста", Перечисления.УТЗ_ПЛ_ВидыПутевыхЛистов.Легковой);
	СтруктураОтвета.Вставить("ДатаВводаВЭксплуатацию", Дата(1, 1, 1));
	СтруктураОтвета.Вставить("Возраст", 0);
	СтруктураОтвета.Вставить("ОсновнойВодитель", Справочники.УТЗ_ПЛ_Водители.ПустаяСсылка());
	СтруктураОтвета.Вставить("ПодразделениеВладелец", Справочники.СтруктураПредприятия.ПустаяСсылка());
	СтруктураОтвета.Вставить("Топливо", Справочники.УТЗ_ПЛ_Топливо.ПустаяСсылка());
	СтруктураОтвета.Вставить("Пробег", 0);
	СтруктураОтвета.Вставить("ОстатокТоплива", 0);
	СтруктураОтвета.Вставить("НормаРасходаОсновная", 0);
	СтруктураОтвета.Вставить("НормаРасходаДополнительнаяНаПеревозку", 0);
	СтруктураОтвета.Вставить("Моточасы", 0);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УТЗ_ПЛ_АвтотранспортСписокВодителей.Ссылка КАК Ссылка,
	|	УТЗ_ПЛ_АвтотранспортСписокВодителей.Водитель КАК Водитель
	|ПОМЕСТИТЬ ВТОсновныеВодители
	|ИЗ
	|	Справочник.УТЗ_ПЛ_Автотранспорт.СписокВодителей КАК УТЗ_ПЛ_АвтотранспортСписокВодителей
	|ГДЕ
	|	УТЗ_ПЛ_АвтотранспортСписокВодителей.ЭтоОсновнойВодитель
	|	И УТЗ_ПЛ_АвтотранспортСписокВодителей.Ссылка В(&СписокАвтотранспорта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка КАК Ссылка,
	|	УТЗ_ПЛ_Автотранспорт.ВидАвтотранспорта КАК ВидАвтотранспорта,
	|	УТЗ_ПЛ_Автотранспорт.Модель КАК Модель,
	|	УТЗ_ПЛ_Автотранспорт.ВидПутевогоЛистаПоУмолчанию КАК ВидПутевогоЛиста,
	|	УТЗ_ПЛ_Автотранспорт.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВЫБОР
	|		КОГДА УТЗ_ПЛ_Автотранспорт.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(УТЗ_ПЛ_Автотранспорт.ДатаВводаВЭксплуатацию, &ДатаАктуальности, ГОД)
	|	КОНЕЦ КАК Возраст,
	|	УТЗ_ПЛ_Автотранспорт.ПодразделениеВладелец КАК ПодразделениеВладелец,
	|	УТЗ_ПЛ_Автотранспорт.Топливо КАК Топливо,
	|	ЕСТЬNULL(ВТОсновныеВодители.Водитель, ЗНАЧЕНИЕ(Справочник.УТЗ_ПЛ_Водители.ПустаяСсылка)) КАК ОсновнойВодитель
	|ПОМЕСТИТЬ ВТСписокАвтотранспорта
	|ИЗ
	|	Справочник.УТЗ_ПЛ_Автотранспорт КАК УТЗ_ПЛ_Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеВодители КАК ВТОсновныеВодители
	|		ПО УТЗ_ПЛ_Автотранспорт.Ссылка = ВТОсновныеВодители.Ссылка
	|ГДЕ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка В(&СписокАвтотранспорта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеВодители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокАвтотранспорта.Ссылка КАК Автотранспорт,
	|	ВТСписокАвтотранспорта.ВидАвтотранспорта КАК ВидАвтотранспорта,
	|	ВТСписокАвтотранспорта.Модель КАК Модель,
	|	ВТСписокАвтотранспорта.ВидПутевогоЛиста КАК ВидПутевогоЛиста,
	|	ВТСписокАвтотранспорта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТСписокАвтотранспорта.Возраст КАК Возраст,
	|	ВТСписокАвтотранспорта.ПодразделениеВладелец КАК ПодразделениеВладелец,
	|	ВТСписокАвтотранспорта.Топливо КАК Топливо,
	|	ВТСписокАвтотранспорта.ОсновнойВодитель КАК ОсновнойВодитель,
	|	ЕСТЬNULL(УТЗ_ПЛ_МоточасыАвтотранспортаОбороты.КоличествоОборот, 0) КАК Моточасы,
	|	ЕСТЬNULL(УТЗ_ПЛ_ОстаткиТопливаОстатки.КоличествоОстаток, 0) КАК ОстатокТоплива,
	|	ЕСТЬNULL(УТЗ_ПЛ_ПробегАвтотранспортаОстатки.КоличествоОстаток, 0) КАК Пробег,
	|	ЕСТЬNULL(УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних.НормаРасходаОсновная, 0) КАК НормаРасходаОсновная,
	|	ЕСТЬNULL(УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних.НормаРасходаДополнительнаяНаПеревозку, 0) КАК НормаРасходаДополнительнаяНаПеревозку
	|ИЗ
	|	ВТСписокАвтотранспорта КАК ВТСписокАвтотранспорта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УТЗ_ПЛ_МоточасыАвтотранспорта.Обороты(, , , Автотранспорт В (&СписокАвтотранспорта)) КАК УТЗ_ПЛ_МоточасыАвтотранспортаОбороты
	|		ПО ВТСписокАвтотранспорта.Ссылка = УТЗ_ПЛ_МоточасыАвтотранспортаОбороты.Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УТЗ_ПЛ_ОстаткиТоплива.Остатки(&ДатаАктуальности, Автотранспорт В (&СписокАвтотранспорта)) КАК УТЗ_ПЛ_ОстаткиТопливаОстатки
	|		ПО ВТСписокАвтотранспорта.Ссылка = УТЗ_ПЛ_ОстаткиТопливаОстатки.Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УТЗ_ПЛ_ПробегАвтотранспорта.Остатки(&ДатаАктуальности, Автотранспорт В (&СписокАвтотранспорта)) КАК УТЗ_ПЛ_ПробегАвтотранспортаОстатки
	|		ПО ВТСписокАвтотранспорта.Ссылка = УТЗ_ПЛ_ПробегАвтотранспортаОстатки.Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта.СрезПоследних(&ДатаАктуальности, Автотранспорт В (&СписокАвтотранспорта)) КАК УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних
	|		ПО ВТСписокАвтотранспорта.Ссылка = УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних.Автотранспорт";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("СписокАвтотранспорта", СписокБезДубликатов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ответ = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка, , "Автотранспорт");
		
		Ответ.Вставить(Выборка.Автотранспорт, СтруктураОтвета);
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

// Функция - Сведения об автотранспорте на дату
//
// Параметры:
//  Автотранспорт - СправочникСсылка.УТЗ_ПЛ_Автотранспорт  - 
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить сведения 
// 
// Возвращаемое значение:
//  Структура:
//		* ВидАвтотранспорта	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыАвтотранспорта
//		* Модель - СправочникСсылка.УТЗ_ПЛ_МоделиАвтотранспорта
//		* ВидПутевогоЛиста - ПеречислениеСсылка.УТЗ_ПЛ_ВидыПутевыхЛистов
//		* ДатаВводаВЭксплуатацию - Дата
//		* Возраст - Число
//		* ОсновнойВодитель - СправочникСсылка.УТЗ_ПЛ_Водители
//		* ПодразделениеВладелец - СправочникСсылка.СтруктураПредприятия
//		* Топливо - СправочникСсылка.УТЗ_ПЛ_Топливо
//		* Пробег - Число
//		* ОстатокТоплива - Число
//		* НормаРасходаОсновная - Число
//		* НормаРасходаДополнительнаяНаПеревозку - Число
//		* Моточасы - Число
Функция СведенияОбАвтотранспортеНаДату(Автотранспорт, ДатаАктуальности = Неопределено) Экспорт	
	
	АвтотранспортВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Автотранспорт);
	Сведения = СведенияОбАвтотранспортеНаДатуПоСписку(АвтотранспортВМассиве, ДатаАктуальности);
	
	Ответ = Сведения.Получить(Автотранспорт);
	
	Если Ответ = Неопределено Тогда
		СтруктураОтвета = Новый Структура;
		
		СтруктураОтвета.Вставить("Автотранспорт", Справочники.УТЗ_ПЛ_Автотранспорт.ПустаяСсылка());
		СтруктураОтвета.Вставить("ВидАвтотранспорта", Перечисления.УТЗ_ПЛ_ВидыАвтотранспорта.ПустаяСсылка());
		СтруктураОтвета.Вставить("Модель", Справочники.УТЗ_ПЛ_МоделиАвтотранспорта.ПустаяСсылка());
		СтруктураОтвета.Вставить("ВидПутевогоЛиста", Перечисления.УТЗ_ПЛ_ВидыПутевыхЛистов.Легковой);
		СтруктураОтвета.Вставить("ДатаВводаВЭксплуатацию", Дата(1, 1, 1));
		СтруктураОтвета.Вставить("Возраст", 0);
		СтруктураОтвета.Вставить("ОсновнойВодитель", Справочники.УТЗ_ПЛ_Водители.ПустаяСсылка());
		СтруктураОтвета.Вставить("ПодразделениеВладелец", Справочники.СтруктураПредприятия.ПустаяСсылка());
		СтруктураОтвета.Вставить("Топливо", Справочники.УТЗ_ПЛ_Топливо.ПустаяСсылка());
		СтруктураОтвета.Вставить("Пробег", 0);
		СтруктураОтвета.Вставить("ОстатокТоплива", 0);
		СтруктураОтвета.Вставить("НормаРасходаОсновная", 0);
		СтруктураОтвета.Вставить("НормаРасходаДополнительнаяНаПеревозку", 0);
		СтруктураОтвета.Вставить("Моточасы", 0);
		Ответ = СтруктураОтвета;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Функция - Остаток топлива автотранспорта на дату
//
// Параметры:
//  Автотранспорт	 - СправочникСсылка.УТЗ_ПЛ_Автотранспорт - 
//  ДатаАктуальности - Дата	 - Если не задана, принимается текущая дата
// 
// Возвращаемое значение:
//  Число - Остаток топлива на дату
//
Функция ОстатокТопливаАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности = Неопределено) Экспорт
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();		
	КонецЕсли;
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УТЗ_ПЛ_ОстаткиТопливаОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.УТЗ_ПЛ_ОстаткиТоплива.Остатки(&ДатаАктуальности, Автотранспорт = &Автотранспорт) КАК УТЗ_ПЛ_ОстаткиТопливаОстатки";	
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Автотранспорт", Автотранспорт);
	
	Результат = Запрос.Выполнить();
	
	ОстатокТоплива = 0;
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОстатокТоплива = Выборка.КоличествоОстаток;
	КонецЕсли;
	
	Возврат ОстатокТоплива;
	
КонецФункции

// Функция - Нормативный расход топлива автотранспорта
//
// Параметры:
//  ПараметрыПолучения	 - 	Структура - Параметры, полученные с помощью метода 
//										УТЗ_ПЛ_Автотранспорт.ПараметрыПолученияНормативногоРасходаТоплива
//										* Автотранспорт 				- СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//										* Прицеп						- СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//										* СуммарнаяМассаГруза			- Число
//										* Расстояние					- Число
//										* КоэффициентНаселенногоПункта	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ
//										* КоэффициентКлассаДороги		- ПеречислениеСсылка.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ
//										* КоэффициентГорнойМестности	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ (не используется)
//  ДатаАктуальности	 - Дата - Дата актуальности получения данных 
// 
// Возвращаемое значение:
//  Число - нормативный расход автотранспорта
//
Функция НормативныйРасходТопливаАвтотранспорта(ПараметрыПолучения, ДатаАктуальности = Неопределено) Экспорт
	
	// Если ключевые параметры не заданы, тогда ничего не делаем
	Если Не ЗначениеЗаполнено(ПараметрыПолучения.Автотранспорт)
		Или Не ЗначениеЗаполнено(ПараметрыПолучения.Расстояние) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ДатаАктуальности = Неопределено Тогда 
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Проверяем, нужно ли учитывать прицеп при расчете
	НужноУчитыватьПрицеп = Ложь;
	МассаПрицепа = 0;
	Если ЗначениеЗаполнено(ПараметрыПолучения.Прицеп) Тогда 
		НужноУчитыватьПрицеп = Истина;
		МассаПрицепа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПолучения.Прицеп, "СобственнаяМасса", Истина);
	КонецЕсли;
	
	// Определяем виды коэффициентов, которые не нужно принимать к расчету из параметров получения. 
	// Если коэффициенты не заполнены, то их и исключаем
	// Параллельно добавляем в массив переданные коэффициенты для удобства
	ИсключаемыеВидыКоэффициентов = Новый Массив;
	ПереданныеКоэффициенты = Новый Массив;
	
	УчитыватьНаселенныйПункт = Истина;
	УчитыватьКлассДороги = Истина;
	
	Если Не ЗначениеЗаполнено(ПараметрыПолучения.КоэффициентНаселенногоПункта) Тогда
		ИсключаемыеВидыКоэффициентов.Добавить(Перечисления.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ.КоэффициентНаселенногоПункта);
		УчитыватьНаселенныйПункт = Ложь;
	Иначе
		ПереданныеКоэффициенты.Добавить(ПараметрыПолучения.КоэффициентНаселенногоПункта);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПараметрыПолучения.КоэффициентКлассаДороги) Тогда
		ИсключаемыеВидыКоэффициентов.Добавить(Перечисления.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ.КоэффициентКлассаДороги);
		УчитыватьКлассДороги = Ложь;
	Иначе
		ПереданныеКоэффициенты.Добавить(ПараметрыПолучения.КоэффициентКлассаДороги);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентКондиционера КАК КоэффициентКондиционера,
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентВозрастаПробега1 КАК КоэффициентВозрастаПробега1,
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентВозрастаПробега2 КАК КоэффициентВозрастаПробега2,
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьКлассДороги КАК УчитыватьКлассДороги,
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьРазмерНаселенногоПункта КАК УчитыватьРазмерНаселенногоПункта,
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьВозрастПробег КАК УчитыватьВозрастПробег,
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьКондиционер КАК УчитыватьКондиционер
	|ПОМЕСТИТЬ ВТНастройкиПутевыхЛистов
	|ИЗ
	|	РегистрСведений.УТЗ_ПЛ_НастройкиПутевыхЛистов.СрезПоследних(&ДатаАктуальности, ) КАК УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка КАК Автотранспорт,
	|	РАЗНОСТЬДАТ(УТЗ_ПЛ_Автотранспорт.ДатаВводаВЭксплуатацию, &ДатаАктуальности, ГОД) КАК Возраст,
	|	ЕСТЬNULL(УТЗ_ПЛ_ПробегАвтотранспортаОстатки.КоличествоОстаток, 0) КАК Пробег,
	|	ЕСТЬNULL(УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних.НормаРасходаОсновная, 0) КАК НормаРасходаТоплива,
	|	ЕСТЬNULL(УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних.НормаРасходаДополнительнаяНаПеревозку, 0) КАК НормаРасходаТопливаНаПеревозку,
	|	ЕСТЬNULL(УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТопливаСрезПоследних.Коэффициент, ЗНАЧЕНИЕ(Справочник.УТЗ_ПЛ_КоэффициентыРасходаТоплива.ПустаяСсылка)) КАК Коэффициент,
	|	ЕСТЬNULL(УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТопливаСрезПоследних.Значение, 0) КАК Значение
	|ИЗ
	|	Справочник.УТЗ_ПЛ_Автотранспорт КАК УТЗ_ПЛ_Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УТЗ_ПЛ_ПробегАвтотранспорта.Остатки(&ДатаАктуальности, Автотранспорт = &Автотранспорт) КАК УТЗ_ПЛ_ПробегАвтотранспортаОстатки
	|		ПО УТЗ_ПЛ_Автотранспорт.Ссылка = УТЗ_ПЛ_ПробегАвтотранспортаОстатки.Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта.СрезПоследних(&ДатаАктуальности, Автотранспорт = &Автотранспорт) КАК УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних
	|		ПО УТЗ_ПЛ_Автотранспорт.Ссылка = УТЗ_ПЛ_НормыРасходаТопливаАвтотранспортаСрезПоследних.Автотранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива.СрезПоследних(
	|				&ДатаАктуальности,
	|				Автотранспорт = &Автотранспорт
	|					И НЕ Коэффициент.ВидКоэффициента В (&ИсключаемыеВидыКоэффициентов)) КАК УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТопливаСрезПоследних
	|		ПО УТЗ_ПЛ_Автотранспорт.Ссылка = УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТопливаСрезПоследних.Автотранспорт
	|ГДЕ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка = &Автотранспорт
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент
	|ИТОГИ
	|	МАКСИМУМ(Возраст),
	|	МАКСИМУМ(Пробег),
	|	МАКСИМУМ(НормаРасходаТоплива),
	|	МАКСИМУМ(НормаРасходаТопливаНаПеревозку)
	|ПО
	|	Автотранспорт";
	
	Запрос.УстановитьПараметр("Автотранспорт", ПараметрыПолучения.Автотранспорт);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ИсключаемыеВидыКоэффициентов", ИсключаемыеВидыКоэффициентов);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	ВыборкаКоэффициенты = Выборка.Выбрать();
	
	ВыборкаНастройки = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТНастройкиПутевыхЛистов"].ПолучитьДанные().Выбрать();
	ВыборкаНастройки.Следующий();
	
	// Инициализация переменных для расчета
	КоэффициентКондиционера 			= ВыборкаНастройки.КоэффициентКондиционера;
	КоэффициентВозрастаПробега1 		= ВыборкаНастройки.КоэффициентВозрастаПробега1;
	КоэффициентВозрастаПробега2 		= ВыборкаНастройки.КоэффициентВозрастаПробега2;
	УчитыватьКлассДороги 				= ВыборкаНастройки.УчитыватьКлассДороги;
	УчитыватьВозрастПробег 				= ВыборкаНастройки.УчитыватьВозрастПробег;
	УчитыватьКондиционер 				= ВыборкаНастройки.УчитыватьКондиционер;
	СуммарнаяМассаГруза 				= ПараметрыПолучения.СуммарнаяМассаГруза;
	Расстояние 							= ПараметрыПолучения.Расстояние;
	КоэффициентНаселенногоПункта 		= ПараметрыПолучения.КоэффициентНаселенногоПункта;
	КоэффициентКлассаДороги 			= ПараметрыПолучения.КоэффициентКлассаДороги;
	НормаРасходаТоплива 				= Выборка.НормаРасходаТоплива;
	НормаРасходаТопливаНаПеревозку 		= Выборка.НормаРасходаТопливаНаПеревозку;
	Пробег								= Выборка.Пробег;
	Возраст								= Выборка.Возраст;
	
	// Определяем коэффициент возраста и пробега исходя полученных данных
	КоэффициентВозрастаПробегаКРасчету = Неопределено;
	
	Если (Возраст >= 5 И Возраст < 8) Или (Пробег >= 100000 И Пробег < 150000) Тогда
		КоэффициентВозрастаПробегаКРасчету = КоэффициентВозрастаПробега1;
	ИначеЕсли Возраст >= 8 Или Пробег >= 150000 Тогда
		КоэффициентВозрастаПробегаКРасчету = КоэффициентВозрастаПробега2;
	Иначе
		КоэффициентВозрастаПробегаКРасчету = Справочники.УТЗ_ПЛ_КоэффициентыРасходаТоплива.ПустаяСсылка();
	КонецЕсли;
	
	ОсновнойРасход = 0;
	ДополнительныйРасходНаПеревозкуГрузов = 0;
	
	// Расчет основного расхода
	ОсновнойРасход = (Расстояние / 100) * НормаРасходаТоплива;
	
	// Расчет дополнительного расхода на перевозку грузов
	Если СуммарнаяМассаГруза <> 0 Или НужноУчитыватьПрицеп Тогда
		
		МассаГрузаКРасчету = СуммарнаяМассаГруза + МассаПрицепа;
		
		// Норма расхода на транспортную работу - это сколько литров дополнительно израсходует автотранспорт 
		// при перевозке 1 тонны груза на 100 км. 
		// Считаем сколько сотен километров был перевезен груз
		СотенКилометров = Расстояние / 100;
		
		// Считаем, сколько тонн груза всего на автотранспорте
		ТоннГруза = МассаГрузаКРасчету / 1000;
		
		// Пример - Считаем, что норма расхода на перевозку 1 тонны на 1 сотню км - 5 литров. Соответственно,
		// перевозка 0,5 тонны на 1 сотню км уменьшит доп.расход вдвое,
		// как и если будет перевезена 1 тонна на 0.5 сотни км., т.е. составит 2.5 л.
		// Если же автотранспорт перевез 0.5 тонн на расстояние 0.5 км, то доп.расход уменьшится еще пропорционально
		// Соответственно формула расчета:
		//	НормаРасхода 	* ТоннГруза * СотенКилометров   = ДопРасход
		//	    5			*	0.5		*	0.5				= 1.25
		ДополнительныйРасходНаПеревозкуГрузов = НормаРасходаТопливаНаПеревозку * СотенКилометров * ТоннГруза;
		
	КонецЕсли;
	
	// Рассчитываем повышающие коэффициенты
	СуммаЗначенийВсехКоэффициентов = 0;
	ИмяПоляОтбора = "Коэффициент";
	ВыборкаКоэффициенты.Сбросить();
	Если УчитыватьНаселенныйПункт
		И ВыборкаКоэффициенты.НайтиСледующий(Новый Структура(ИмяПоляОтбора, КоэффициентНаселенногоПункта)) Тогда
		СуммаЗначенийВсехКоэффициентов = СуммаЗначенийВсехКоэффициентов + ВыборкаКоэффициенты.Значение;
	КонецЕсли;
	
	ВыборкаКоэффициенты.Сбросить();
	Если УчитыватьКлассДороги
		И ВыборкаКоэффициенты.НайтиСледующий(Новый Структура(ИмяПоляОтбора, КоэффициентКлассаДороги)) Тогда
		СуммаЗначенийВсехКоэффициентов = СуммаЗначенийВсехКоэффициентов + ВыборкаКоэффициенты.Значение;
	КонецЕсли;
	
	ВыборкаКоэффициенты.Сбросить();
	Если УчитыватьВозрастПробег
		И ВыборкаКоэффициенты.НайтиСледующий(Новый Структура(ИмяПоляОтбора, КоэффициентВозрастаПробегаКРасчету)) Тогда
		СуммаЗначенийВсехКоэффициентов = СуммаЗначенийВсехКоэффициентов + ВыборкаКоэффициенты.Значение;
	КонецЕсли;
	
	ВыборкаКоэффициенты.Сбросить();
	Если УчитыватьКондиционер
		И ВыборкаКоэффициенты.НайтиСледующий(Новый Структура(ИмяПоляОтбора, КоэффициентКондиционера)) Тогда
		СуммаЗначенийВсехКоэффициентов = СуммаЗначенийВсехКоэффициентов + ВыборкаКоэффициенты.Значение;
	КонецЕсли;
	
	ИтоговыйПовышающийКоэффициент = 1 + (СуммаЗначенийВсехКоэффициентов / 100);
	
	ИтоговыйРасход = (ОсновнойРасход + ДополнительныйРасходНаПеревозкуГрузов) * ИтоговыйПовышающийКоэффициент;
	
	ОкругленныйРасход = Окр(ИтоговыйРасход, 3);
	
	Возврат ОкругленныйРасход;
	
КонецФункции

// Функция - Параметры получения нормативного расхода топлива
// 
// Возвращаемое значение:
//  Структура - 
//			* Автотранспорт - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//			* Прицеп - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//			* СуммарнаяМассаГруза - Число
//			* Расстояние - Число
//			* КоэффициентНаселенногоПункта - СправочникСсылка.УТЗ_ПЛ_КоэффициентыРасходаТоплива
//			* КоэффициентКлассаДороги - СправочникСсылка.УТЗ_ПЛ_КоэффициентыРасходаТоплива
//			* (не используется) КоэффициентГорнойМестности - СправочникСсылка.УТЗ_ПЛ_КоэффициентыРасходаТоплива
//
Функция ПараметрыПолученияНормативногоРасходаТоплива() Экспорт
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("Автотранспорт", Справочники.УТЗ_ПЛ_Автотранспорт.ПустаяСсылка());
	ПараметрыПолучения.Вставить("Прицеп", Справочники.УТЗ_ПЛ_Автотранспорт.ПустаяСсылка());
	ПараметрыПолучения.Вставить("СуммарнаяМассаГруза", 0);
	ПараметрыПолучения.Вставить("Расстояние", 0);
	ПараметрыПолучения.Вставить("КоэффициентНаселенногоПункта", 
								Перечисления.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ.ПустаяСсылка());
	ПараметрыПолучения.Вставить("КоэффициентКлассаДороги", 
								Перечисления.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ.ПустаяСсылка());
	ПараметрыПолучения.Вставить("КоэффициентГорнойМестности", 
								Перечисления.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ.ПустаяСсылка());
	
	Возврат ПараметрыПолучения;
	
КонецФункции

#КонецОбласти
